Revit 2024 API
FabricationSaveJobOptions.Dispose Method
Releases all resources used by the FabricationSaveJobOptions
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace